podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_MKE06Z4.svd.xml
            <register>
               <name>PINSEL1</name>
               <description>Pin Selection Register 1</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>FTM2PS0</name>
                     <description>FTM2 Channel 0 Pin Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>PTC0</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>PTH0</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>PTF0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2PS1</name>
                     <description>FTM2 Channel 1 Pin Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>PTC1</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>PTH1</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>PTF1</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2PS2</name>
                     <description>FTM2 Channel 2 Pin Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>PTC2</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>PTD0</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>PTG4</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2PS3</name>
                     <description>FTM2 Channel 3 Pin Select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>PTC3</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>PTD1</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>PTG5</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2PS4</name>
                     <description>FTM2 Channel 4 Pin Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PTB4</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>PTG6</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2PS5</name>
                     <description>FTM2 Channel 5 Pin Select</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PTB5</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>PTG7</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>I2C1PS</name>
                     <description>I2C1 Pin Select</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>I2C1_SCL on PTE1, I2C1_SDA on PTE0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>I2C1_SCL on PTH4, I2C1_SDA on PTH3</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPI1PS</name>
                     <description>SPI1 Pin Select</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PTD0, PTD1, PTD2, and PTD3 mapped as SPI pins</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>PTG4, PTG5, PTG6, and PTG7 mapped as SPI pins</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART1PS</name>
                     <description>UART1 Pin Select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>UART1_TX on PTC7, UART1_RX on PTC6</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>UART1_TX on PTF3, UART1_RX on PTF2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART2PS</name>
                     <description>UART2 Pin Select</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>UART2_TX on PTD7, UART2_RX on PTD6</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>UART2_TX on PTI1, UART2_RX on PTI0</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWTIN0PS</name>
                     <description>PWTIN0 Pin Select</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PWTIN0 on PTD5</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>PWTIN0 on PTE2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWTIN1PS</name>
                     <description>PWTIN1 Pin Select</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PWTIN1 on PTB0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>PWTIN1 on PTH7</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MSCANPS</name>
                     <description>MSCAN Pin Select\n
Selects the pins used by MSCAN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>CAN_TX on PTC7, CAN_RX on PTC6</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CAN_TX on PTE7, CAN_RX on PTH2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCGC</name>
               <description>System Clock Gating Control Register</description>
               <addressOffset>0x14</addressOffset>
               <resetValue>0x3000</resetValue>
               <fields>
                  <field>
                     <name>RTC</name>
                     <description>RTC Clock Gate Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RTC" > <name>PIT</name> <description>PIT Clock Gate Control</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>PWT</name> <description>PWT Clock Gate Control</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>FTM0</name> <description>FTM0 Clock Gate Control</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>FTM1</name> <description>FTM1 Clock Gate Control</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>FTM2</name> <description>FTM2 Clock Gate Control</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>CRC</name> <description>CRC Clock Gate Control</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>FLASH</name> <description>FLASH Clock Gate Control</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>SWD</name> <description>SWD Clock Gate Control</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>MSCAN</name> <description>MSCAN Clock Gate Control</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>I2C0</name> <description>I2C0 Clock Gate Control</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>I2C1</name> <description>I2C1 Clock Gate Control</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>SPI0</name> <description>SPI0 Clock Gate Control</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>SPI1</name> <description>SPI1 Clock Gate Control</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>UART0</name> <description>UART0 Clock Gate Control</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>UART1</name> <description>UART1 Clock Gate Control</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>UART2</name> <description>UART2 Clock Gate Control</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>KBI0</name> <description>KBI0 Clock Gate Control</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>KBI1</name> <description>KBI1 Clock Gate Control</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>IRQ</name> <description>IRQ Clock Gate Control</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>ADC0</name> <description>ADC Clock Gate Control</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>ACMP0</name> <description>ACMP0 Clock Gate Control</description> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="RTC" > <name>ACMP1</name> <description>ACMP1 Clock Gate Control</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>UUIDL</name>
               <description>Universally Unique Identifier Low Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-write</access>
            </register>
            <register>
               <name>UUIDML</name>
               <description>Universally Unique Identifier Middle Low Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-write</access>
            </register>
            <register>
               <name>UUIDMH</name>
               <description>Universally Unique Identifier Middle High Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-write</access>
            </register>
            <register>
               <name>CLKDIV</name>
               <description>BUS Clock Divider Register</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>OUTDIV3</name>
                     <description>Clock 3 Output Divider value\n
This field sets the divide value for the timers(FTM0, FTM2,PWT)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>ICSOUTCLK</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>ICSOUTCLK/2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTDIV2</name>
                     <description>Clock 2 Output Divider value\n
This field sets the divide value for the bus/FLASH, follows OUTDIV1</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not divided from divider1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Divide by 2 from divider1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTDIV1</name>
                     <description>Clock 1 Output Divider value\n
This field sets the divide value for the core/system clock</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>ICSOUTCLK</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>ICSOUTCLK/2</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>ICSOUTCLK/3</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>ICSOUTCLK/4</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
